{
  "embed": {
    "color": 15285048,
    "description": "EssentialsX officially supports the **CraftBukkit**, **Spigot**, and [**Paper (recommended)**](https://papermc.io/) server software running the following Minecraft versions:\n• ✅ **1.18.2** and **1.19.2** (or **1.19.3** on developer builds) - EssentialsX actively develops against and supports these versions.\n• ⚠️ **1.8.8**, **1.9.4**, **1.10.2**, **1.11.2**, **1.12.2**, **1.13.2**, **1.14.4**, **1.15.2**, **1.16.5**, and **1.17.1** - these versions are still supported, but are not a priority for us, and may be dropped in a future release.\n\nEssentialsX **does not support** the following Minecraft versions and server software:",
    "footer": {
      "text": "We will not be able to provide support if you use any of the unsupported software or versions listed above."
    },
    "fields": [
      {
        "name": "• 🛑 Mohist",
        "value": "Do not use Mohist. Mohist has previously tricked users into deleting official EssentialsX jars and installing unofficial modified software. [Click here for more information.](https://essentialsx.net/do-not-use-mohist.html)"
      },
      {
        "name": "• 🛑 Magma",
        "value": "Magma modifies the EssentialsX bytecode at runtime and includes hacks to fix other bugs within Magma. If you encounter an issue with EssentialsX on Magma, please contact them for support."
      },
      {
        "name": "• 🛑 \"Ultra-performance\" Paper forks",
        "value": "This includes Akarin, Yatopia, and similar projects - these often perform non-standard behavior and can break your worlds and installed plugins."
      },
      {
        "name": "• 🛑 Other Forge/Bukkit hybrid server software, including Cauldron, Thermos, CatServer, etc",
        "value": "EssentialsX is built for the Bukkit API, which does not properly support mods.\nFor Forge servers, use [SpongeForge](https://www.spongepowered.org/downloads/spongeforge) with [Nucleus](https://nucleuspowered.org), or an alternative mod for [Forge/Fabric](https://www.curseforge.com/minecraft/mc-mods)."
      },
      {
        "name": "• 🛑 1.7.10 or below",
        "value": "Please don't use versions that were made <t:1403740800:R>"
      }
    ]
  }
}
